<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"85c1f77070b70aa09682117026579c18c7f7b2d14d5f55d95368343fbdaf62b6","plan_job_ref":"Job terraform plan #32 at https://github.com/suzutan/infra/actions/runs/8953555897","plan_out_hash":"376def3a07400d052e930dc5079593549ea5e87c81188342db8bfc77416d4a64","plan_hash":"703529ce13896caa38b1aaf3692a402fa72483f48de7cd307b6a131ab2e5aceb","plan_text_format":"diff","version":"1.42.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # github_team.role_members will be created
+   resource "github_team" "role_members" {
+       create_default_maintainer = false
+       description               = "all members"
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "members"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "secret"
+       slug                      = (known after apply)
    }

  # github_team_membership.members["suzutan"] will be created
+   resource "github_team_membership" "members" {
+       etag     = (known after apply)
+       id       = (known after apply)
+       role     = "maintainer"
+       team_id  = (known after apply)
+       username = "suzutan"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #32](https://github.com/suzutan/infra/actions/runs/8953555897)